{"author":"Vinyl Alchemist (Guest)",
"title":"Here's the picture set",
"text":"http://www.facebook.com/media/set/?set=a.4998491000432.194610.1244476057&type=1\n",
"ts":"2012-12-11T23:29:00-08:00 Los_Angeles"}
{"author":"Vinyl Alchemist (Guest)",
"title":"I made a small version with casters.",
"text":"I also made a small version with wheels.  I use it as my DJ table. Easy and fun to build. Thanks for sharing! http://www.facebook.com/media/set/edit/a.4998491000432.194610.1244476057/\n",
"ts":"2012-12-11T23:27:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Great design!  Thank you for the idea.  Where did you get the monitor and monitor stand?  I have a MacBook Pro and will need similar configuration.  Cheers!\n",
"ts":"2012-11-20T17:36:00-08:00 Los_Angeles"}
{"author":"scapulator (Guest)",
"title":"little brother",
"text":"i made the smaller version of this using only 1 case\nstill an awesome desk\nhttp://i.imgur.com/IrDLj.jpg",
"ts":"2012-11-01T14:22:00-07:00 Los_Angeles"}
{"author":"Blake (Guest)",
"title":"After 8 months...",
"text":"How has this held up for you?  Just curious if you would change anything since you built?  I'm thinking about making this over the weekend.\n",
"ts":"2012-10-05T02:38:00-07:00 Los_Angeles"}
{"author":"damion (Guest)",
"title":"awesome recipe!",
"text":"I stumbled across your hack as I was looking for standing desk ideas, and I gave it a try. I'm incredibly pleased with the results!! I even wrote a blog post about it: http://mycrankygut.com/2012/09/10/its-not-always-about-cranky-guts-and-fancy-diets/ One thing you didn't mention, and I thought I should point out... when securing the nut on the middle-rear tabletop bracket, BE VERY CAREFUL NOT TO OVERTIGHTEN!! The tabletop is very flimsy at that point. Tighten the nut until it just touches the table surface!\n\nThanks for the terrific idea!!",
"ts":"2012-09-13T19:03:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Just built",
"text":"Just built this last weekend. Was an enjoyable process and I'm really enjoying the results. I added the two 11\" lack shelves as speaker stands and left out one of the horizontal shelves on the right side of the bookcase so that my computer could fit in that slot. Only thing that's bugging me a little bit is the desk is a little wobbly. Is anyone else having this problem? I didn't take the time to level it yet but the legs don't seem to be the problem. I wonder if it's b/c I didn't include that one shelf.\n",
"ts":"2012-08-21T23:53:00-07:00 Los_Angeles"}
{"author":"Chris (Guest)",
"title":"Screws",
"text":"What are the best types of screws to use for this material? Also, what size bolts and drill? Or do the brackets come with bolts? Planning on building this weekend. Thanks. \n",
"ts":"2012-08-13T17:18:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"wheels",
"text":"has anyone used the wheels instead of the legs? how did it turn out? \n",
"ts":"2012-08-13T14:00:00-07:00 Los_Angeles"}
{"author":"SETH FROM NASHVILLE (Guest)",
"title":"GREAT DESIGN- NOW, LOVIN' MINE",
"text":"Thanks for the details. Enjoyed the construction, fairly easy. I did put on a 43\" Lack shelf using 2 Capita brackets. Works great for iMac and nice storage underneath too. I'm 5'8\" so I did not use the bottom legs.  Put in a 2 drawer unit and Branas basket.  Added (2) Expedit inserts with door. I put a small UPS behind the door and now have clean hidden access to power and wall warts. The only thing I might have done different is use (2) 11\" Lack shelves instead and use them as speaker stands with iMac  sitting between them. THANKS AGAIN for a truly delicious design. Peace\n",
"ts":"2012-08-07T17:19:00-07:00 Los_Angeles"}
{"author":"Charley (Guest)",
"title":"Dunn & Dunn!",
"text":"Hi. Just letting you know I built a desk using your design. Exactly the same, just using one Expedit, and a shorter Vika Amon top. So, half as wide, in other words.\n\nThe only difference was, for the front Capita brackets I kept the round discs on top of the brackets to make the desk flat back to front. I hacksawed the bolts down and drilled two pilot holes in the front underside of the desk, and the cut bolts popped into those. You gotta be careful with those Vika Amon tops, as they are hollow in the middle.\n\nBTW, I didn't use epoxy, but I did squeeze some \"no more nails\" down the screw holes to give the screws some better purchase. Both the Expedit and the Vita Amon tops are made of a composite wood material which screws can turn to sawdust over time. Especially if you over tighten them! I used a manual screwdriver for the final turns, just to make sure the drill didn't gouge the wood.\n\nThanks again for your design. The cost of the project for me was $200 (Australian)\n\n",
"ts":"2012-07-28T19:58:00-07:00 Los_Angeles"}
{"author":"M. Steve (Guest)",
"title":"Thank you so much",
"text":"We followed your plans today, and it worked out great!  I need a standing desk because of my back, and the cheapest ones I could find that didn't look like scrap metal were $400.  I already had the Expedit bookcase, so this ran about $150 total.  The 6\" legs are correct for me at 6'2\", although I spaced 4 legs evenly on each long end of the bookcase in my design.  We also shimmed the front braces to make the table level.\n\nI really appreciate your putting this guide together; do you take PayPal/Google Checkout donations?",
"ts":"2012-07-15T21:26:00-07:00 Los_Angeles"}
{"author":"Steve (Guest)",
"title":"Balance",
"text":"Looks fantastic! If the brackets beneath the table top were mounted in the same direction in order to bring the table out farther.. do you think the bookshelf would be out of balance? Thanks!\n",
"ts":"2012-07-11T20:45:00-07:00 Los_Angeles"}
{"author":"Daniel Brierton (Guest)",
"title":"Inverting Capita Brackets",
"text":"Love this design, think I'll definitely go with this for my standing desk. I'm going to flip the Capita brackets though, and place them a little bit further in, using 8 instead of 6, just for symmetry. It requires longer bolts to get through the thicker wall of the Expedit shelves, but that's easy to rectify.\n\nThanks for sharing!",
"ts":"2012-06-16T21:38:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Wheels",
"text":"I think I'm goign to go for these when I put this together\nhttp://www.ikea.com/us/en/catalog/products/60169977/",
"ts":"2012-06-09T16:48:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Big Thanks",
"text":"Thanks for this wonderful step by step build of an inexpensive way to try a standing desk,I have an injury I am hoping it will work.  bought all that you suggested with the full size book shelf as the base and no bottom legs as I am about 5'4\" tall.  I got lucky and all the parts minus the bottom legs for about 160.00 a great savings.\n",
"ts":"2012-05-28T16:29:00-07:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Help Please!",
"text":"Hi there. This was a very helpful article and inspired me to do a TV stand using similar components.\n\nI notice that you drilled a hole through the Vika Amon tabletop and let the bolts be visible on the top surface. I want to avoid doing that.\n\nI don't know how to mount the Vika Amon tabletop to the Capita Brackets. If I just use industrial strength glue and \"stick\" the tabletop on top of the brackets, do you think that will be enough (structural strength?) ??",
"ts":"2012-03-05T13:46:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"This is great. Def inspired my design on the desk below. \n\nhttp://www.ikeahackers.net/2012/01/vika-brad-standing-desk.html?m=1",
"ts":"2012-02-18T00:44:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Where do the Signum go?",
"text":"Very cool hack; where do the Signum go in order to hide all the wires? \n",
"ts":"2012-01-16T22:47:00-08:00 Los_Angeles"}
{"author":"Elle (Guest)",
"title":"Question about adjustment for 5'2\" (elbow is 40\")",
"text":"Looks amazing! Do you have any suggestions for short ladies?  I am 5'2\", my elbow probably needs to rest at 40\" off the ground.  Can you tell me what I should do to make it fit my needs? Thanks so much!!\n",
"ts":"2012-01-16T14:15:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Epoxy",
"text":"I don't know if epoxy is needed. But at least for the bottom legs I think it's a good idea. From my experience screws in particule bard or very weak if you move them laterally (like moving the desk). On the other hand adhesives like epoxy are very good at that. So i figure screws + epoxy should help. Note that Expedit material is not too bad compare to some other Ikea stuff. \n",
"ts":"2012-01-11T23:45:00-08:00 Los_Angeles"}
{"author":"shelf (Guest)",
"title":"yeahhhh bro",
"text":"i'd been planning on making something like this for a long time, i just agonise over screwing things into the expedit. might give it a go with epoxy and a 4x2 expedit. nice work bro\n",
"ts":"2012-01-11T23:24:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"My 2 cents.",
"text":"Cool, glad you like it. I actually bought a Lak shelf too, but haven't mounted it yet as the shortest capita brackets where out of stock.\n",
"ts":"2012-01-11T11:46:00-08:00 Los_Angeles"}
{"author":"BDunk (Guest)",
"title":"I built one",
"text":"I had been looking for a design with a 44\" desk height and that would allow for two workstations.  I knew this was the one for me as soon as I saw it =]  Assembled it last night and it was well worth the effort.  I added a Lack shelf (via more Capita brackets) on top for monitors and it turned out great!  Thank you very much for sharing your project and inspiring me to build my own!\n",
"ts":"2012-01-11T11:43:00-08:00 Los_Angeles"}
{"author":"Guest (Guest)",
"title":"Monitor stand",
"text":"It's just this: http://www.amazon.com/gp/product/B0043H39WM/ref=oh_o02_s00_i00_details\n",
"ts":"2012-01-08T21:55:00-08:00 Los_Angeles"}
{"author":"BH (Guest)",
"title":"Monitor Stand on IKEA standing desk",
"text":"A very nice project.  I'm interested in the monitor stand.  how did that go together?\n",
"ts":"2012-01-08T21:35:00-08:00 Los_Angeles"}